<script>
import router from "../router/index.js";
import customInput from "../components/layout/customInput.vue";
import customButton from "../components/layout/customButton.vue";
import snsPage from "./snsPage.vue";
import myPage from "./myPage.vue";
import {apiClient} from "../utils/axios.js";
import {onMounted} from "vue";


export default {
  name: "mainPage",
  components: {
    customInput,
    customButton,
    snsPage,
    myPage,
  },

  setup() {
    const move = () => {
      window.location.href = '#'
    }
    const moving = () => {
      window.location.href = '#'
    }
    const right = () => {
      // .news-ul {
      //   transform: translateX(241px)
      // }
    }
    // function filter() {

    // var content = document.getElementById("searchbar").value;
    // if (content.trim() === "") {
    //   alert("검색어를 입력해주세요")
    //   return false;
    // } else if (content.trim() === "") {
    //   alert("")
    // }
    // window.onload = function () {//윈도우가 열리면
    //   document.getElementById("A").onclick = function () {
    //     alert("A함수호5출");
    //     console.log(el.value)
    //   }
    //
    //   document.getElementById("B").onclick = function () {
    //     alert("B함수호출");
    //   }
    // }

    // }

    return {

      move,
      moving,
    };
  }
};
</script>
<template>
  <!--  <input type="button" value="A함수호출" id="A" @click="filter"/>-->
  <!--  <input type="button" value="B함수호출" id="B"/>-->

  <div class="main-box">
    <div class="main-fir">
      <span>감성있는 캠핑장을 찾고있나요?</span>
      <custom-button :placeholder="`캠핑장 양도 받기/찾기`" :onClick="move"></custom-button>
    </div>
    <div class="main-sec">
      <span>저렴한 캠핑용품이 필요하신가요?</span>
      <custom-button :placeholder="`캠핑용품 중고거래`" :onClick="moving"></custom-button>
    </div>
  </div>


  <div class="main-icon">
    <a href="#">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M37.5277 18.3964H37.5277V18.3937C37.5277 15.4638 39.7699 13.0396 42.3216 11.6552L42.3216 11.6552C42.7768 11.4083 43.0292 11.503 43.1538 11.6153C43.3118 11.7579 43.461 12.0994 43.3778 12.6574L43.3773 12.6605C43.3684 12.7231 43.3538 12.8 43.3351 12.8986C43.3259 12.9474 43.3156 13.0015 43.3046 13.0618C43.3014 13.0782 43.2981 13.095 43.2947 13.1122C43.2314 13.4363 43.1429 13.8892 43.1429 14.1717C43.1429 18.2427 46.3864 21.5499 50.4677 21.5499H50.4723C50.5351 21.5499 50.6088 21.5499 50.6844 21.5466C51.2807 21.5309 51.6159 21.6961 51.7359 21.8395C51.7855 21.8988 51.8099 21.9646 51.8038 22.0561C51.797 22.1585 51.7486 22.3203 51.5923 22.5403C50.653 23.8623 49.4748 24.9064 48.0618 25.4818L47.3361 23.632C47.121 23.0635 46.7374 22.5743 46.2365 22.2298C45.7351 21.8849 45.1402 21.7016 44.5317 21.7045H38.2865C37.782 20.6764 37.5217 19.5442 37.5277 18.3964Z"
            fill="#FA6C1A" stroke="#2F2E2C"/>
        <path d="M10 49.2667L19.6336 24.9152H44.3865L54.1538 49.2667H28.9995L21.373 29.7319V49.2667H10Z"
              stroke="#2F2E2C"
              stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>

          </filter>
        </defs>
      </svg>
      <span>텐트</span>
    </a>


    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M57 43C57.5523 43 58 42.5523 58 42C58 41.4477 57.5523 41 57 41L57 43ZM37 41L36 41L36 43L37 43L37 41ZM57 41L37 41L37 43L57 43L57 41Z"
            fill="#2F2E2C"/>
        <path
            d="M41 42V43H43V42H41ZM42 22H43V21H42V22ZM34 22V21H33V22H34ZM33 32.9524V33.9524H35V32.9524H33ZM43 42V22H41V42H43ZM42 21H34V23H42V21ZM33 22V32.9524H35V22H33Z"
            fill="#2F2E2C"/>
        <path
            d="M52 42.0462V27.2615L45.1383 14.3846C44.6809 13.5897 43.3085 12 41.4787 12H12.2021C11.1348 12 9 12.5723 9 14.8615V40.6154C9 41.4103 9.45745 43 11.2872 43H14.9468"
            stroke="#2F2E2C" stroke-width="2" stroke-linecap="square" stroke-linejoin="round"/>
        <rect x="16" y="22" width="12" height="8" fill="#FA6C1A" stroke="#2F2E2C" stroke-width="2"/>
        <circle cx="25.5" cy="43.5" r="5.5" stroke="#2F2E2C" stroke-width="2"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>카라반</span>
    </a>

    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M32.4176 29.6741C30.1111 35.6205 25.1686 44.5402 22.2031 49H42.9617C39.5019 44.5402 34.8889 35.6205 32.4176 29.6741Z"
            fill="#FA6C1A"/>
        <path
            d="M32.5824 12L33.4044 11.4306C33.2281 11.176 32.9438 11.0175 32.6346 11.0014C32.3253 10.9852 32.026 11.1132 31.8241 11.348L32.5824 12ZM17.59 23.8929L17.1212 23.0096C16.8374 23.1602 16.6433 23.438 16.5994 23.7563L17.59 23.8929ZM14.1303 49L13.1396 48.8635C13.1002 49.1498 13.1865 49.4392 13.3764 49.6571C13.5664 49.8749 13.8412 50 14.1303 50V49ZM51.0345 49V50C51.3237 50 51.5987 49.8748 51.7886 49.6567C51.9785 49.4387 52.0647 49.149 52.025 48.8626L51.0345 49ZM47.5747 24.058L48.5652 23.9206C48.5223 23.6111 48.3371 23.3394 48.0647 23.1863L47.5747 24.058ZM11 48C10.4477 48 10 48.4477 10 49C10 49.5523 10.4477 50 11 50V48ZM54 50C54.5523 50 55 49.5523 55 49C55 48.4477 54.5523 48 54 48V50ZM22.2031 49L21.3704 48.4463C21.1663 48.7532 21.1476 49.1475 21.3217 49.4724C21.4958 49.7972 21.8345 50 22.2031 50V49ZM32.4176 29.6741L33.3411 29.2903C33.1843 28.9132 32.814 28.6693 32.4057 28.6742C31.9973 28.679 31.633 28.9317 31.4853 29.3125L32.4176 29.6741ZM42.9617 49V50C43.3434 50 43.6918 49.7827 43.8597 49.4399C44.0276 49.0971 43.9858 48.6886 43.7518 48.3871L42.9617 49ZM31.8241 11.348C29.1513 14.4566 22.6021 20.1004 17.1212 23.0096L18.0589 24.7761C23.7811 21.7389 30.5218 15.9303 33.3406 12.652L31.8241 11.348ZM16.5994 23.7563L13.1396 48.8635L15.1209 49.1365L18.5807 24.0294L16.5994 23.7563ZM14.1303 50H51.0345V48H14.1303V50ZM52.025 48.8626L48.5652 23.9206L46.5842 24.1954L50.044 49.1374L52.025 48.8626ZM48.0647 23.1863C46.2872 22.1873 43.4003 20.3858 40.5555 18.2494C37.6921 16.099 34.9571 13.6722 33.4044 11.4306L31.7603 12.5694C33.5027 15.085 36.4516 17.6686 39.3545 19.8486C42.276 22.0426 45.2377 23.8916 47.0847 24.9298L48.0647 23.1863ZM11 50H54V48H11V50ZM23.0358 49.5537C26.0302 45.0504 31.0109 36.0661 33.3499 30.0357L31.4853 29.3125C29.2113 35.175 24.307 44.0299 21.3704 48.4463L23.0358 49.5537ZM31.4942 30.0579C33.9795 36.0382 38.6327 45.0512 42.1716 49.6129L43.7518 48.3871C40.3711 44.0292 35.7982 35.2029 33.3411 29.2903L31.4942 30.0579ZM42.9617 48H22.2031V50H42.9617V48Z"
            fill="#2F2E2C"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>글램핑</span>
    </a>

    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M16 25L18.125 15.7917C18.4792 14.5278 20.0375 12 23.4375 12H42.0312C45.75 12 47.3438 14.1667 47.875 15.7917L50 25"
            stroke="#2F2E2C" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        <path
            d="M50.2973 25H15.7027C13.5405 25 13 27.6078 13 28.9118V41.2059C13 43.4412 15.1622 44 16.2432 44H49.7568C52.3513 44 53 42.1373 53 41.2059V28.9118C53 25.7824 51.1982 25 50.2973 25Z"
            stroke="#2F2E2C" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        <path
            d="M17.5 47C17.5 48.3807 18.6193 49.5 20 49.5C21.3807 49.5 22.5 48.3807 22.5 47L17.5 47ZM22.5 46L22.5 43.5L17.5 43.5L17.5 46L22.5 46ZM22.5 47L22.5 46L17.5 46L17.5 47L22.5 47Z"
            fill="#2F2E2C"/>
        <path
            d="M43.5 47C43.5 48.3807 44.6193 49.5 46 49.5C47.3807 49.5 48.5 48.3807 48.5 47L43.5 47ZM48.5 46L48.5 43.5L43.5 43.5L43.5 46L48.5 46ZM48.5 47L48.5 46L43.5 46L43.5 47L48.5 47Z"
            fill="#2F2E2C"/>
        <path
            d="M15 23H17V19H15V23ZM14 19C12.8954 19 12 19.8954 12 21C12 22.1046 12.8954 23 14 23V19ZM15 19H14.5V23H15V19ZM14.5 19H14V23H14.5V19Z"
            fill="#2F2E2C"/>
        <path
            d="M51 19L49 19L49 23L51 23L51 19ZM52 23C53.1046 23 54 22.1046 54 21C54 19.8954 53.1046 19 52 19L52 23ZM51 23L51.5 23L51.5 19L51 19L51 23ZM51.5 23L52 23L52 19L51.5 19L51.5 23Z"
            fill="#2F2E2C"/>
        <circle cx="23.3635" cy="34.3636" r="2.22727" fill="#FA6C1A" stroke="#2F2E2C"/>
        <circle cx="44.091" cy="34.3636" r="2.22727" fill="#FA6C1A" stroke="#2F2E2C"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>오토캠핑</span>
    </a>

    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M29.5 20L27.5 30C27.1667 32.5 25 37.6 19 38H13.5L14 26.5C14 22 15.5 12.5 25.5 12.5H36C36.8333 12.5 38.8 12.9 40 14.5L45 22L54 23.5V26L52.5 34C52 36 50.5 37.5 48 38C45.6466 38.4707 39.6667 39 37 39.5V50"
            stroke="#2F2E2C" stroke-width="2"/>
        <circle cx="36.7273" cy="20.7273" r="2.22727" fill="#FA6C1A" stroke="#2F2E2C"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>반려동물</span>
    </a>

    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path
            d="M32.3149 12.3258C42.8857 12.3258 48.0452 20.191 49.6182 24.5955C55.9104 24.5955 56.5396 28.6854 56.5396 31.2022C56.5396 35.7325 51.7156 37.0749 49.3036 37.1797C44.8991 47.2472 37.034 49.1348 32.0003 49.1348C21.1778 49.1348 15.7456 40.8501 14.3823 36.8651C8.84521 36.8651 7.46094 33.1947 7.46094 31.2022C7.46094 25.4134 12.18 24.5955 14.3823 24.5955C19.7306 13.5842 26.9666 12.3258 32.3149 12.3258Z"
            stroke="#2F2E2C" stroke-width="2"/>
        <path
            d="M22.875 26.875H26.25V30.25H22.875V26.875ZM37.75 26.875H41.125V30.25H37.75V26.875ZM35.1571 41.872C34.1562 42.2866 33.0834 42.5 32 42.5C29.812 42.5 27.7135 41.6308 26.1664 40.0836C25.4003 39.3175 24.7926 38.4081 24.378 37.4071C24.0273 36.5605 23.8206 35.6624 23.7652 34.75H40.2348C40.1794 35.6624 39.9727 36.5605 39.622 37.4071C39.2074 38.4081 38.5997 39.3175 37.8336 40.0836C37.0675 40.8497 36.1581 41.4574 35.1571 41.872Z"
            fill="#FA6C1A" stroke="#2F2E2C"/>
        <rect x="23" y="27" width="3" height="3" fill="#2F2E2C"/>
        <rect x="38" y="27" width="3" height="3" fill="#2F2E2C"/>
        <path d="M32.2 11.4L31.6 12.2L33.2 13.4L33.8 12.6L32.2 11.4ZM33.8 12.6L36.8 8.6L35.2 7.4L32.2 11.4L33.8 12.6Z"
              fill="#2F2E2C"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>키즈</span>
    </a>

    <a href="">
      <svg width="68" height="68" viewBox="0 0 68 68" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_1_2)">
          <rect x="2" width="60" height="60" rx="10" fill="white"/>
          <rect x="2.5" y="0.5" width="59" height="59" rx="9.5" stroke="#DBDBDB"/>
        </g>
        <path d="M31.6361 13.3636L20.7271 25H43.2725L31.6361 13.3636Z" stroke="#2F2E2C" stroke-width="3"
              stroke-linecap="round" stroke-linejoin="round"/>
        <path
            d="M51.6172 30H11.9647H10.1118C9.22235 30 9 30.9212 9 31.3818L11.2235 44.5091C12.4094 47.5491 15.1764 48.7697 16.4117 49H47.1702C50.7278 49 52.3583 46.0061 52.7289 44.5091L54.9524 31.3818C55.2489 30.2764 54.0877 30 53.4701 30H51.6172Z"
            stroke="#2F2E2C" stroke-width="2"/>
        <path d="M8 25L56 25" stroke="#FA6C1A" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
        <defs>
          <filter id="filter0_d_1_2" x="0" y="0" width="68" height="68" filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB">
            <feFlood flood-opacity="0" result="BackgroundImageFix"/>
            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                           result="hardAlpha"/>
            <feOffset dx="2" dy="4"/>
            <feGaussianBlur stdDeviation="2"/>
            <feComposite in2="hardAlpha" operator="out"/>
            <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
            <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1_2"/>
            <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_2" result="shape"/>
          </filter>
        </defs>
      </svg>
      <span>캠프닉</span>
    </a>
  </div>

  <div class="main-story">
    <svg width="301" height="26" viewBox="0 0 301 26" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path
          d="M45.147 10.8203H40.4808C40.3956 10.2166 40.2216 9.6804 39.9588 9.21165C39.696 8.73579 39.3587 8.33097 38.9467 7.99716C38.5348 7.66335 38.0589 7.40767 37.5192 7.23011C36.9865 7.05256 36.4077 6.96378 35.7827 6.96378C34.6534 6.96378 33.6697 7.24432 32.8317 7.8054C31.9936 8.35937 31.3438 9.16903 30.8821 10.2344C30.4205 11.2926 30.1896 12.5781 30.1896 14.0909C30.1896 15.6463 30.4205 16.9531 30.8821 18.0114C31.3509 19.0696 32.0043 19.8686 32.8423 20.4084C33.6804 20.9482 34.6499 21.218 35.7507 21.218C36.3686 21.218 36.9403 21.1364 37.4659 20.973C37.9986 20.8097 38.4709 20.5717 38.8828 20.2592C39.2947 19.9396 39.6357 19.5526 39.9055 19.098C40.1825 18.6435 40.3743 18.125 40.4808 17.5426L45.147 17.5639C45.0263 18.5653 44.7244 19.5312 44.2415 20.4616C43.7656 21.3849 43.1229 22.2124 42.3132 22.9439C41.5107 23.6683 40.5518 24.2436 39.4368 24.6697C38.3288 25.0888 37.0753 25.2983 35.6761 25.2983C33.7301 25.2983 31.9901 24.858 30.456 23.9773C28.929 23.0966 27.7216 21.8217 26.8338 20.1527C25.9531 18.4837 25.5128 16.4631 25.5128 14.0909C25.5128 11.7116 25.9602 9.6875 26.8551 8.01847C27.75 6.34943 28.9645 5.07812 30.4986 4.20455C32.0327 3.32386 33.7585 2.88352 35.6761 2.88352C36.9403 2.88352 38.1122 3.06108 39.1918 3.41619C40.2784 3.77131 41.2408 4.28977 42.0788 4.97159C42.9169 5.64631 43.5987 6.47372 44.1243 7.45383C44.657 8.43395 44.9979 9.55611 45.147 10.8203ZM51.8054 25H46.8622L54.3942 3.18182H60.3388L67.8601 25H62.9169L57.4517 8.16761H57.2812L51.8054 25ZM51.4964 16.424H63.1726V20.0249H51.4964V16.424ZM70.4862 3.18182H76.1751L82.1836 17.8409H82.4393L88.4478 3.18182H94.1367V25H89.6623V10.799H89.4812L83.8349 24.8935H80.788L75.1417 10.7457H74.9606V25H70.4862V3.18182ZM97.9373 25V3.18182H106.545C108.2 3.18182 109.61 3.49787 110.775 4.12997C111.939 4.75497 112.827 5.625 113.438 6.74006C114.056 7.84801 114.365 9.12642 114.365 10.5753C114.365 12.0241 114.052 13.3026 113.427 14.4105C112.802 15.5185 111.897 16.3814 110.711 16.9993C109.532 17.6172 108.104 17.9261 106.428 17.9261H100.942V14.2294H105.682C106.57 14.2294 107.302 14.0767 107.877 13.7713C108.459 13.4588 108.893 13.0291 109.177 12.4822C109.468 11.9283 109.613 11.2926 109.613 10.5753C109.613 9.85085 109.468 9.21875 109.177 8.67898C108.893 8.1321 108.459 7.70952 107.877 7.41122C107.295 7.10582 106.556 6.95312 105.661 6.95312H102.55V25H97.9373ZM121.974 3.18182V25H117.361V3.18182H121.974ZM144.019 3.18182V25H140.034L130.542 11.2678H130.382V25H125.769V3.18182H129.818L139.235 16.9034H139.427V3.18182H144.019ZM162.297 10.2344C162.148 9.71591 161.939 9.25781 161.669 8.86008C161.399 8.45526 161.069 8.11435 160.678 7.83736C160.294 7.55327 159.854 7.33665 159.357 7.1875C158.867 7.03835 158.324 6.96378 157.727 6.96378C156.612 6.96378 155.632 7.24077 154.787 7.79474C153.949 8.34872 153.295 9.15483 152.826 10.2131C152.358 11.2642 152.123 12.5497 152.123 14.0696C152.123 15.5895 152.354 16.8821 152.816 17.9474C153.277 19.0128 153.931 19.826 154.776 20.3871C155.621 20.9411 156.619 21.218 157.77 21.218C158.814 21.218 159.705 21.0334 160.444 20.6641C161.189 20.2876 161.757 19.7585 162.148 19.0767C162.546 18.3949 162.745 17.5888 162.745 16.6584L163.682 16.7969H158.057V13.3239H167.187V16.0724C167.187 17.9901 166.782 19.6378 165.973 21.0156C165.163 22.3864 164.048 23.4446 162.627 24.1903C161.207 24.929 159.581 25.2983 157.748 25.2983C155.703 25.2983 153.906 24.8473 152.358 23.9453C150.809 23.0362 149.602 21.7472 148.735 20.0781C147.876 18.402 147.446 16.4134 147.446 14.1122C147.446 12.3437 147.702 10.767 148.213 9.3821C148.732 7.99006 149.456 6.81108 150.387 5.84517C151.317 4.87926 152.4 4.14418 153.636 3.63991C154.872 3.13565 156.211 2.88352 157.652 2.88352C158.888 2.88352 160.039 3.06463 161.104 3.42685C162.169 3.78196 163.114 4.28622 163.938 4.93963C164.769 5.59304 165.447 6.37074 165.973 7.27273C166.498 8.16761 166.836 9.15483 166.985 10.2344H162.297ZM189.431 9.45668C189.346 8.5973 188.98 7.92969 188.334 7.45383C187.688 6.97798 186.811 6.74006 185.703 6.74006C184.95 6.74006 184.314 6.84659 183.796 7.05966C183.277 7.26562 182.88 7.55327 182.603 7.92258C182.333 8.2919 182.198 8.71094 182.198 9.17969C182.184 9.57031 182.265 9.91122 182.443 10.2024C182.627 10.4936 182.88 10.7457 183.199 10.9588C183.519 11.1648 183.888 11.3459 184.307 11.5021C184.726 11.6513 185.174 11.7791 185.65 11.8857L187.61 12.3544C188.561 12.5675 189.435 12.8516 190.23 13.2067C191.026 13.5618 191.715 13.9986 192.297 14.517C192.88 15.0355 193.331 15.6463 193.65 16.3494C193.977 17.0526 194.144 17.8587 194.151 18.7678C194.144 20.103 193.803 21.2607 193.128 22.2408C192.461 23.2138 191.495 23.9702 190.23 24.5099C188.973 25.0426 187.457 25.3089 185.681 25.3089C183.92 25.3089 182.386 25.0391 181.079 24.4993C179.779 23.9595 178.764 23.1605 178.032 22.1023C177.308 21.0369 176.928 19.7195 176.892 18.1499H181.356C181.406 18.8814 181.615 19.4922 181.985 19.9822C182.361 20.4652 182.862 20.831 183.487 21.0795C184.119 21.321 184.833 21.4418 185.628 21.4418C186.409 21.4418 187.088 21.3281 187.663 21.1009C188.245 20.8736 188.696 20.5575 189.016 20.1527C189.336 19.7479 189.495 19.2827 189.495 18.7571C189.495 18.267 189.35 17.8551 189.059 17.5213C188.775 17.1875 188.355 16.9034 187.801 16.669C187.255 16.4347 186.583 16.2216 185.788 16.0298L183.412 15.4332C181.573 14.9858 180.12 14.2862 179.055 13.3345C177.99 12.3828 177.461 11.1009 177.468 9.48864C177.461 8.16761 177.812 7.01349 178.522 6.02628C179.24 5.03906 180.223 4.26847 181.473 3.71449C182.723 3.16051 184.144 2.88352 185.735 2.88352C187.354 2.88352 188.767 3.16051 189.975 3.71449C191.189 4.26847 192.134 5.03906 192.809 6.02628C193.483 7.01349 193.831 8.15696 193.853 9.45668H189.431ZM196.423 6.98508V3.18182H214.342V6.98508H207.662V25H203.102V6.98508H196.423ZM236.346 14.0909C236.346 16.4702 235.895 18.4943 234.993 20.1634C234.099 21.8324 232.877 23.1072 231.329 23.9879C229.787 24.8615 228.055 25.2983 226.13 25.2983C224.191 25.2983 222.451 24.858 220.91 23.9773C219.368 23.0966 218.15 21.8217 217.256 20.1527C216.361 18.4837 215.913 16.4631 215.913 14.0909C215.913 11.7116 216.361 9.6875 217.256 8.01847C218.15 6.34943 219.368 5.07812 220.91 4.20455C222.451 3.32386 224.191 2.88352 226.13 2.88352C228.055 2.88352 229.787 3.32386 231.329 4.20455C232.877 5.07812 234.099 6.34943 234.993 8.01847C235.895 9.6875 236.346 11.7116 236.346 14.0909ZM231.67 14.0909C231.67 12.5497 231.439 11.25 230.977 10.1918C230.523 9.13352 229.88 8.33097 229.049 7.78409C228.218 7.23722 227.245 6.96378 226.13 6.96378C225.015 6.96378 224.042 7.23722 223.211 7.78409C222.38 8.33097 221.733 9.13352 221.272 10.1918C220.817 11.25 220.59 12.5497 220.59 14.0909C220.59 15.6321 220.817 16.9318 221.272 17.9901C221.733 19.0483 222.38 19.8509 223.211 20.3977C224.042 20.9446 225.015 21.218 226.13 21.218C227.245 21.218 228.218 20.9446 229.049 20.3977C229.88 19.8509 230.523 19.0483 230.977 17.9901C231.439 16.9318 231.67 15.6321 231.67 14.0909ZM239.763 25V3.18182H248.371C250.019 3.18182 251.425 3.47656 252.59 4.06605C253.762 4.64844 254.653 5.47585 255.264 6.5483C255.882 7.61364 256.191 8.86719 256.191 10.3089C256.191 11.7578 255.879 13.0043 255.254 14.0483C254.629 15.0852 253.723 15.8807 252.537 16.4347C251.358 16.9886 249.93 17.2656 248.254 17.2656H242.491V13.5582H247.509C248.389 13.5582 249.121 13.4375 249.703 13.196C250.286 12.9545 250.719 12.5923 251.003 12.1094C251.294 11.6264 251.44 11.0263 251.44 10.3089C251.44 9.58452 251.294 8.97372 251.003 8.47656C250.719 7.9794 250.282 7.60298 249.692 7.3473C249.11 7.08452 248.375 6.95312 247.487 6.95312H244.376V25H239.763ZM251.546 15.071L256.969 25H251.876L246.571 15.071H251.546ZM257.264 3.18182H262.431L267.406 12.5781H267.619L272.595 3.18182H277.762L269.803 17.2869V25H265.222V17.2869L257.264 3.18182Z"
          fill="black"/>
      <path
          d="M297.162 13.0514C297.253 12.9586 301 9.62246 301 9.62246L300.362 9.34414C299.997 9.1623 300.092 8.91738 300.179 8.69844C300.267 8.41641 300.912 6.20098 300.912 6.20098C300.912 6.20098 299.172 6.57207 298.808 6.66484C298.534 6.75391 298.443 6.57207 298.352 6.38652C298.26 6.20098 297.804 5.18418 297.804 5.18418C297.804 5.18418 295.885 7.40703 295.794 7.49609C295.429 7.77441 295.061 7.49609 295.152 7.125C295.152 6.75391 296.159 2.31562 296.159 2.31562C296.159 2.31562 295.061 2.96133 294.696 3.14688C294.423 3.33242 294.236 3.33242 294.054 2.96133C293.868 2.68301 292.496 0 292.496 0C292.496 0 291.128 2.68301 290.946 2.96133C290.764 3.33242 290.581 3.33242 290.304 3.14688C289.939 2.96133 288.841 2.31562 288.841 2.31562C288.841 2.31562 289.848 6.75391 289.848 7.125C289.939 7.49609 289.574 7.77441 289.206 7.49609C289.115 7.40332 287.196 5.18418 287.196 5.18418C287.196 5.18418 286.74 6.19727 286.648 6.38281C286.557 6.56836 286.466 6.7502 286.192 6.66113C285.824 6.56836 284.088 6.19727 284.088 6.19727C284.088 6.19727 284.73 8.4127 284.821 8.69473C284.908 8.91738 285.003 9.15859 284.638 9.34043L284 9.62246C284 9.62246 287.743 12.9586 287.838 13.0514C288.024 13.2369 288.203 13.3297 288.024 13.8863C287.838 14.443 287.655 15.1889 287.655 15.1889C287.655 15.1889 291.128 14.443 291.497 14.3502C291.814 14.3168 292.164 14.443 292.164 14.8141C292.164 15.1852 291.953 19 291.953 19H293.047C293.047 19 292.836 15.1889 292.836 14.8141C292.836 14.4393 293.182 14.3168 293.507 14.3502C293.872 14.443 297.345 15.1889 297.345 15.1889C297.345 15.1889 297.162 14.443 296.98 13.8863C296.797 13.3297 296.98 13.2369 297.162 13.0514Z"
          fill="#876445"/>
      <path
          d="M14.3257 13.0514C14.4233 12.9586 18.4351 9.62246 18.4351 9.62246L17.7515 9.34414C17.3608 9.1623 17.4624 8.91738 17.5562 8.69844C17.6499 8.41641 18.3413 6.20098 18.3413 6.20098C18.3413 6.20098 16.478 6.57207 16.0874 6.66484C15.7944 6.75391 15.6968 6.57207 15.5991 6.38652C15.5015 6.20098 15.0132 5.18418 15.0132 5.18418C15.0132 5.18418 12.9585 7.40703 12.8608 7.49609C12.4702 7.77441 12.0757 7.49609 12.1733 7.125C12.1733 6.75391 13.2515 2.31562 13.2515 2.31562C13.2515 2.31562 12.0757 2.96133 11.6851 3.14688C11.3921 3.33242 11.1929 3.33242 10.9976 2.96133C10.7983 2.68301 9.32959 0 9.32959 0C9.32959 0 7.86475 2.68301 7.66943 2.96133C7.47412 3.33242 7.27881 3.33242 6.98193 3.14688C6.59131 2.96133 5.41553 2.31562 5.41553 2.31562C5.41553 2.31562 6.49365 6.75391 6.49365 7.125C6.59131 7.49609 6.20068 7.77441 5.80615 7.49609C5.7085 7.40332 3.65381 5.18418 3.65381 5.18418C3.65381 5.18418 3.16553 6.19727 3.06787 6.38281C2.97021 6.56836 2.87256 6.7502 2.57959 6.66113C2.18506 6.56836 0.325684 6.19727 0.325684 6.19727C0.325684 6.19727 1.01318 8.4127 1.11084 8.69473C1.20459 8.91738 1.30615 9.15859 0.915527 9.34043L0.231934 9.62246C0.231934 9.62246 4.23975 12.9586 4.34131 13.0514C4.54053 13.2369 4.73193 13.3297 4.54053 13.8863C4.34131 14.443 4.146 15.1889 4.146 15.1889C4.146 15.1889 7.86475 14.443 8.25928 14.3502C8.59912 14.3168 8.97412 14.443 8.97412 14.8141C8.97412 15.1852 8.74756 19 8.74756 19H9.91943C9.91943 19 9.69287 15.1889 9.69287 14.8141C9.69287 14.4393 10.064 14.3168 10.4116 14.3502C10.8022 14.443 14.521 15.1889 14.521 15.1889C14.521 15.1889 14.3257 14.443 14.1304 13.8863C13.9351 13.3297 14.1304 13.2369 14.3257 13.0514Z"
          fill="#876445"/>
    </svg>
    <span>자신의 캠핑스타일 자랑해보세요</span>
  </div>
  <div class="main-sns">
    <sns-page></sns-page>
  </div>
  <div class="view-all">
    <custom-button :placeholder="`view All`" :onClick="moving"></custom-button>
  </div>

  <div class="add-banner">
    <div class="add-img">
      <span>#입술 끝에 맺혀있는 말</span>
      <span>#너만 보면 하고 싶은 말</span>
      <span>#너무 소중해 아껴두려고 참고 또 참는 말</span>
      <custom-button :placeholder="`상품 보러가기 ▼`" :onClick="moving"></custom-button>
    </div>
  </div>
  <div class="main-campsite">
    <h2>HAND OVER A CAMPSITE</h2>
    <custom-button :placeholder="`view All`" :onClick="moving"></custom-button>
  </div>

  <div class="main-autocamp">
    <div class="autocamp">
      <img src="/public/assets/image/mainutoCamp.png" alt="">
      <h1>피아골 오토 캠핑장</h1>
      <span>테크 13번 9/27~9/29 양도합니다. 테크 4*4...</span>
      <a href="">전라남도 구례군 </a>
      <h2>45.000원</h2>
      <span>1시간 전</span>
    </div>
    <div class="autocamp">
      <img src="/public/assets/image/mainutoCamp.png" alt="">
      <h1>피아골 오토 캠핑장</h1>
      <span>테크 13번 9/27~9/29 양도합니다. 테크 4*4...</span>
      <a href="">전라남도 구례군 </a>
      <h2>59.000원</h2>
      <span>1시간 전</span>
    </div>
    <div class="autocamp">
      <img src="/public/assets/image/mainutoCamp.png" alt="">
      <h1>피아골 오토 캠핑장</h1>
      <span>테크 13번 9/27~9/29 양도합니다. 테크 4*4...</span>
      <a href="">전라남도 구례군 </a>
      <h2>59.000원</h2>
      <span>1시간 전</span>
    </div>
  </div>

  <div class="main-campsite">
    <h2>USED MARKET</h2>
    <custom-button :placeholder="`view All`" :onClick="moving"></custom-button>
  </div>
  <div class="market-box">
    <!--    1-->
    <div class="main-market">
      <div class="market-img">
        <svg width="50" height="19" viewBox="0 0 50 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="50" height="19" rx="5" fill="#EA3323"/>
          <path
              d="M7.708 4.628V5.9H13.636V4.628H7.708ZM7.588 9.92C9.424 9.92 11.944 9.872 14.128 9.488L14.02 8.312C11.872 8.6 9.292 8.624 7.42 8.624L7.588 9.92ZM8.584 5.516V9.2H10.12V5.516H8.584ZM11.236 5.516V9.2H12.76V5.516H11.236ZM14.632 3.956V10.136H16.228V3.956H14.632ZM15.784 6.344V7.652H17.704V6.344H15.784ZM8.968 10.556V14.948H16.228V10.556H14.644V11.504H10.552V10.556H8.968ZM10.552 12.74H14.644V13.676H10.552V12.74ZM26.2111 3.956V15.068H27.8071V3.956H26.2111ZM19.1071 5.012V11.912H20.6911V5.012H19.1071ZM19.1071 10.976V12.332H20.0911C21.7831 12.332 23.6191 12.212 25.5271 11.816L25.3471 10.496C23.5111 10.856 21.7111 10.976 20.0911 10.976H19.1071ZM36.6621 3.944V15.092H38.2701V3.944H36.6621ZM37.9101 8.06V9.368H39.8781V8.06H37.9101ZM29.9901 11.096V12.416H30.9261C32.8581 12.416 34.3821 12.368 36.0621 12.068L35.9061 10.748C34.2741 11.036 32.7981 11.096 30.9261 11.096H29.9901ZM29.9901 4.976V11.732H31.5741V6.26H35.1741V4.976H29.9901Z"
              fill="white"/>
        </svg>
      </div>
      <div class="market-content">
        <h1>Shim Craft [심크레프트]</h1>
        <span class="market-sub">나는야 판매왕</span>
        <span class="market-exp">한번밖에 쓰지 않은 심크레프트    정수기 팝니다~
컬러: 브론드 컬러  </span>
        <span class="market-price">59.000원</span>
      </div>
      <div class="market-calendar">
        <span class="market-time">3일 전</span>
        <span class="market-like">3</span>
        <span class="market-see">89</span>
      </div>
    </div>
    <!--    2-->
    <div class="main-market">
      <div class="market-img">
        <svg width="50" height="19" viewBox="0 0 50 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="50" height="19" rx="5" fill="#EA3323"/>
          <path
              d="M7.708 4.628V5.9H13.636V4.628H7.708ZM7.588 9.92C9.424 9.92 11.944 9.872 14.128 9.488L14.02 8.312C11.872 8.6 9.292 8.624 7.42 8.624L7.588 9.92ZM8.584 5.516V9.2H10.12V5.516H8.584ZM11.236 5.516V9.2H12.76V5.516H11.236ZM14.632 3.956V10.136H16.228V3.956H14.632ZM15.784 6.344V7.652H17.704V6.344H15.784ZM8.968 10.556V14.948H16.228V10.556H14.644V11.504H10.552V10.556H8.968ZM10.552 12.74H14.644V13.676H10.552V12.74ZM26.2111 3.956V15.068H27.8071V3.956H26.2111ZM19.1071 5.012V11.912H20.6911V5.012H19.1071ZM19.1071 10.976V12.332H20.0911C21.7831 12.332 23.6191 12.212 25.5271 11.816L25.3471 10.496C23.5111 10.856 21.7111 10.976 20.0911 10.976H19.1071ZM36.6621 3.944V15.092H38.2701V3.944H36.6621ZM37.9101 8.06V9.368H39.8781V8.06H37.9101ZM29.9901 11.096V12.416H30.9261C32.8581 12.416 34.3821 12.368 36.0621 12.068L35.9061 10.748C34.2741 11.036 32.7981 11.096 30.9261 11.096H29.9901ZM29.9901 4.976V11.732H31.5741V6.26H35.1741V4.976H29.9901Z"
              fill="white"/>
        </svg>
      </div>
      <div class="market-content">
        <h1>Shim Craft [심크레프트]</h1>
        <span class="market-sub">나는야 판매왕</span>
        <span class="market-exp">한번밖에 쓰지 않은 심크레프트    정수기 팝니다~
컬러: 브론드 컬러  </span>
        <span class="market-price">59.000원</span>
      </div>
      <div class="market-calendar">
        <span class="market-time">3일 전</span>
        <span class="market-like">3</span>
        <span class="market-see">89</span>
      </div>
    </div>
    <!--    3-->
    <div class="main-market">
      <div class="market-img">
        <svg width="50" height="19" viewBox="0 0 50 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="50" height="19" rx="5" fill="#EA3323"/>
          <path
              d="M7.708 4.628V5.9H13.636V4.628H7.708ZM7.588 9.92C9.424 9.92 11.944 9.872 14.128 9.488L14.02 8.312C11.872 8.6 9.292 8.624 7.42 8.624L7.588 9.92ZM8.584 5.516V9.2H10.12V5.516H8.584ZM11.236 5.516V9.2H12.76V5.516H11.236ZM14.632 3.956V10.136H16.228V3.956H14.632ZM15.784 6.344V7.652H17.704V6.344H15.784ZM8.968 10.556V14.948H16.228V10.556H14.644V11.504H10.552V10.556H8.968ZM10.552 12.74H14.644V13.676H10.552V12.74ZM26.2111 3.956V15.068H27.8071V3.956H26.2111ZM19.1071 5.012V11.912H20.6911V5.012H19.1071ZM19.1071 10.976V12.332H20.0911C21.7831 12.332 23.6191 12.212 25.5271 11.816L25.3471 10.496C23.5111 10.856 21.7111 10.976 20.0911 10.976H19.1071ZM36.6621 3.944V15.092H38.2701V3.944H36.6621ZM37.9101 8.06V9.368H39.8781V8.06H37.9101ZM29.9901 11.096V12.416H30.9261C32.8581 12.416 34.3821 12.368 36.0621 12.068L35.9061 10.748C34.2741 11.036 32.7981 11.096 30.9261 11.096H29.9901ZM29.9901 4.976V11.732H31.5741V6.26H35.1741V4.976H29.9901Z"
              fill="white"/>
        </svg>
      </div>
      <div class="market-content">
        <h1>Shim Craft [심크레프트]</h1>
        <span class="market-sub">나는야 판매왕</span>
        <span class="market-exp">한번밖에 쓰지 않은 심크레프트    정수기 팝니다~
컬러: 브론드 컬러  </span>
        <span class="market-price">59.000원</span>
      </div>
      <div class="market-calendar">
        <span class="market-time">3일 전</span>
        <span class="market-like">3</span>
        <span class="market-see">89</span>
      </div>
    </div>
    <!--    4-->
    <div class="main-market">
      <div class="market-img">
        <svg width="50" height="19" viewBox="0 0 50 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="50" height="19" rx="5" fill="#EA3323"/>
          <path
              d="M7.708 4.628V5.9H13.636V4.628H7.708ZM7.588 9.92C9.424 9.92 11.944 9.872 14.128 9.488L14.02 8.312C11.872 8.6 9.292 8.624 7.42 8.624L7.588 9.92ZM8.584 5.516V9.2H10.12V5.516H8.584ZM11.236 5.516V9.2H12.76V5.516H11.236ZM14.632 3.956V10.136H16.228V3.956H14.632ZM15.784 6.344V7.652H17.704V6.344H15.784ZM8.968 10.556V14.948H16.228V10.556H14.644V11.504H10.552V10.556H8.968ZM10.552 12.74H14.644V13.676H10.552V12.74ZM26.2111 3.956V15.068H27.8071V3.956H26.2111ZM19.1071 5.012V11.912H20.6911V5.012H19.1071ZM19.1071 10.976V12.332H20.0911C21.7831 12.332 23.6191 12.212 25.5271 11.816L25.3471 10.496C23.5111 10.856 21.7111 10.976 20.0911 10.976H19.1071ZM36.6621 3.944V15.092H38.2701V3.944H36.6621ZM37.9101 8.06V9.368H39.8781V8.06H37.9101ZM29.9901 11.096V12.416H30.9261C32.8581 12.416 34.3821 12.368 36.0621 12.068L35.9061 10.748C34.2741 11.036 32.7981 11.096 30.9261 11.096H29.9901ZM29.9901 4.976V11.732H31.5741V6.26H35.1741V4.976H29.9901Z"
              fill="white"/>
        </svg>
      </div>
      <div class="market-content">
        <h1>Shim Craft [심크레프트]</h1>
        <span class="market-sub">나는야 판매왕</span>
        <span class="market-exp">한번밖에 쓰지 않은 심크레프트    정수기 팝니다~
컬러: 브론드 컬러  </span>
        <span class="market-price">59.000원</span>
      </div>
      <div class="market-calendar">
        <span class="market-time">3일 전</span>
        <span class="market-like">3</span>
        <span class="market-see">89</span>
      </div>
    </div>

  </div>
  <div class="main-bottom">
     <span>
        <h1>파도소리 들리는 감성 캠핑</h1>
        <h2>한번쯤은 꼭 가볼만한 캠핑장! 추천해요~</h2>
      </span>
    <div class="main-recomend">
      <div class="bottom-fir">
        <div class="camping-jang">
          <div class="recomend">추천해요</div>
          <div class="recomend-navi">
            <svg width="30" height="15" viewBox="0 0 15 9" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M1 1L5 5L1 8.5" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M4 1L8 5L4 8.5" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M7 1L11 5L7 8.5" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M10 1L14 5L10 8.5" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
          </div>
          <div class="recomend-text">
            <span>바다와 파도소리, 밤이면 별이 쏟아지는 해변에서 즐기는 감성캠핑. 그곳으로   떠나요~~</span>
          </div>
          <div class="camping-name">
          </div>
        </div>
      </div>

      <div class="bottom-sec">
        <div class="camping-jang">
          <p>학동 자동차 야영지</p>
          <s>
            <svg width="66" height="11" viewBox="0 0 66 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                  d="M6.02621 0.351704C5.91712 0.136774 5.68657 0 5.43338 0C5.18019 0 4.95171 0.136774 4.84055 0.351704L3.51698 2.93672L0.561057 3.35095C0.314045 3.38612 0.108201 3.55025 0.0320385 3.77495C-0.0441238 3.99965 0.0176293 4.2478 0.194655 4.41388L2.33955 6.42836L1.83317 9.27521C1.792 9.50967 1.89493 9.74805 2.09871 9.88678C2.3025 10.0255 2.57215 10.0431 2.79446 9.93172L5.43544 8.59329L8.07642 9.93172C8.29873 10.0431 8.56838 10.0275 8.77217 9.88678C8.97596 9.7461 9.07888 9.50967 9.03771 9.27521L8.52927 6.42836L10.6742 4.41388C10.8512 4.2478 10.915 3.99965 10.8368 3.77495C10.7586 3.55025 10.5548 3.38612 10.3078 3.35095L7.34979 2.93672L6.02621 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M19.6087 0.351704C19.4996 0.136774 19.2691 0 19.0159 0C18.7627 0 18.5342 0.136774 18.4231 0.351704L17.0995 2.93672L14.1436 3.35095C13.8966 3.38612 13.6907 3.55025 13.6146 3.77495C13.5384 3.99965 13.6001 4.2478 13.7772 4.41388L15.9221 6.42836L15.4157 9.27521C15.3745 9.50967 15.4774 9.74805 15.6812 9.88678C15.885 10.0255 16.1547 10.0431 16.377 9.93172L19.018 8.59329L21.6589 9.93172C21.8812 10.0431 22.1509 10.0275 22.3547 9.88678C22.5585 9.7461 22.6614 9.50967 22.6202 9.27521L22.1118 6.42836L24.2567 4.41388C24.4337 4.2478 24.4975 3.99965 24.4193 3.77495C24.3411 3.55025 24.1373 3.38612 23.8903 3.35095L20.9323 2.93672L19.6087 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M33.1917 0.351704C33.0826 0.136774 32.8521 0 32.5989 0C32.3457 0 32.1172 0.136774 32.0061 0.351704L30.6825 2.93672L27.7266 3.35095C27.4796 3.38612 27.2737 3.55025 27.1976 3.77495C27.1214 3.99965 27.1832 4.2478 27.3602 4.41388L29.5051 6.42836L28.9987 9.27521C28.9575 9.50967 29.0605 9.74805 29.2642 9.88678C29.468 10.0255 29.7377 10.0431 29.96 9.93172L32.601 8.59329L35.2419 9.93172C35.4643 10.0431 35.7339 10.0275 35.9377 9.88678C36.1415 9.7461 36.2444 9.50967 36.2032 9.27521L35.6948 6.42836L37.8397 4.41388C38.0167 4.2478 38.0805 3.99965 38.0023 3.77495C37.9241 3.55025 37.7203 3.38612 37.4733 3.35095L34.5153 2.93672L33.1917 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M46.7743 0.351704C46.6652 0.136774 46.4346 0 46.1814 0C45.9282 0 45.6998 0.136774 45.5886 0.351704L44.265 2.93672L41.3091 3.35095C41.0621 3.38612 40.8562 3.55025 40.7801 3.77495C40.7039 3.99965 40.7657 4.2478 40.9427 4.41388L43.0876 6.42836L42.5812 9.2752C42.5401 9.50967 42.643 9.74805 42.8468 9.88678C43.0505 10.0255 43.3202 10.0431 43.5425 9.93172L46.1835 8.59329L48.8245 9.93172C49.0468 10.0431 49.3164 10.0275 49.5202 9.88678C49.724 9.7461 49.8269 9.50967 49.7858 9.2752L49.2773 6.42836L51.4222 4.41388C51.5992 4.2478 51.6631 3.99965 51.5848 3.77495C51.5066 3.55025 51.3028 3.38612 51.0558 3.35095L48.0978 2.93672L46.7743 0.351704Z"
                  fill="#D1D1D1"/>
              <path
                  d="M60.3573 0.351704C60.2482 0.136774 60.0176 0 59.7644 0C59.5112 0 59.2828 0.136774 59.1716 0.351704L57.848 2.93672L54.8921 3.35095C54.6451 3.38612 54.4393 3.55025 54.3631 3.77495C54.2869 3.99965 54.3487 4.2478 54.5257 4.41388L56.6706 6.42836L56.1642 9.27521C56.1231 9.50967 56.226 9.74805 56.4298 9.88678C56.6336 10.0255 56.9032 10.0431 57.1255 9.93172L59.7665 8.59329L62.4075 9.93172C62.6298 10.0431 62.8994 10.0275 63.1032 9.88678C63.307 9.7461 63.4099 9.50967 63.3688 9.27521L62.8603 6.42836L65.0052 4.41388C65.1822 4.2478 65.2461 3.99965 65.1678 3.77495C65.0896 3.55025 64.8858 3.38612 64.6388 3.35095L61.6808 2.93672L60.3573 0.351704Z"
                  fill="#D1D1D1"/>
            </svg>
          </s>
          <span>
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="14" cy="14" r="14" fill="white"/>
            <path
                d="M17.3775 7C17.8833 6.9999 18.3735 7.17343 18.7647 7.49104C19.1559 7.80865 19.4239 8.25072 19.523 8.742L19.6954 9.6H20.3438C20.5023 9.60001 20.6556 9.65689 20.7751 9.76013C20.8946 9.86337 20.9723 10.006 20.9939 10.1616L21 10.25C21 10.4071 20.9426 10.5588 20.8383 10.6772C20.7341 10.7956 20.5901 10.8726 20.433 10.8939L20.3438 10.9H19.9579L20.0559 11.3853C20.3283 11.4642 20.5676 11.6285 20.7378 11.8535C20.9081 12.0786 21.0001 12.3522 21 12.6333V16.9667C21 17.3114 20.8617 17.6421 20.6156 17.8859C20.3694 18.1297 20.0356 18.2667 19.6875 18.2667H19.25V19.1333C19.25 19.3632 19.1578 19.5836 18.9937 19.7462C18.8296 19.9087 18.6071 20 18.375 20C18.1429 20 17.9204 19.9087 17.7563 19.7462C17.5922 19.5836 17.5 19.3632 17.5 19.1333V18.2667H10.5V19.1333C10.5 19.3632 10.4078 19.5836 10.2437 19.7462C10.0796 19.9087 9.85706 20 9.625 20C9.39294 20 9.17038 19.9087 9.00628 19.7462C8.84219 19.5836 8.75 19.3632 8.75 19.1333V18.2667H8.3125C7.9644 18.2667 7.63056 18.1297 7.38442 17.8859C7.13828 17.6421 7 17.3114 7 16.9667V12.6333C6.99994 12.3522 7.09193 12.0786 7.26215 11.8535C7.43237 11.6285 7.67166 11.4642 7.94412 11.3853L8.04125 10.9H7.65625C7.4822 10.9 7.31528 10.8315 7.19221 10.7096C7.06914 10.5877 7 10.4224 7 10.25C7 10.0776 7.06914 9.91228 7.19221 9.79038C7.31528 9.66848 7.4822 9.6 7.65625 9.6H8.30375L8.477 8.742C8.57614 8.25072 8.84411 7.80865 9.23529 7.49104C9.62647 7.17343 10.1167 6.9999 10.6225 7H17.3775ZM19.6875 12.2H8.3125C8.19647 12.2 8.08519 12.2457 8.00314 12.3269C7.92109 12.4082 7.875 12.5184 7.875 12.6333V16.9667C7.875 17.0816 7.92109 17.1918 8.00314 17.2731C8.08519 17.3543 8.19647 17.4 8.3125 17.4H19.6875C19.8035 17.4 19.9148 17.3543 19.9969 17.2731C20.0789 17.1918 20.125 17.0816 20.125 16.9667V12.6333C20.125 12.5184 20.0789 12.4082 19.9969 12.3269C19.9148 12.2457 19.8035 12.2 19.6875 12.2ZM10.5 13.9333C10.7321 13.9333 10.9546 14.0246 11.1187 14.1872C11.2828 14.3497 11.375 14.5701 11.375 14.8C11.375 15.0299 11.2828 15.2503 11.1187 15.4128C10.9546 15.5754 10.7321 15.6667 10.5 15.6667C10.2679 15.6667 10.0454 15.5754 9.88128 15.4128C9.71719 15.2503 9.625 15.0299 9.625 14.8C9.625 14.5701 9.71719 14.3497 9.88128 14.1872C10.0454 14.0246 10.2679 13.9333 10.5 13.9333ZM17.5 13.9333C17.7321 13.9333 17.9546 14.0246 18.1187 14.1872C18.2828 14.3497 18.375 14.5701 18.375 14.8C18.375 15.0299 18.2828 15.2503 18.1187 15.4128C17.9546 15.5754 17.7321 15.6667 17.5 15.6667C17.2679 15.6667 17.0454 15.5754 16.8813 15.4128C16.7172 15.2503 16.625 15.0299 16.625 14.8C16.625 14.5701 16.7172 14.3497 16.8813 14.1872C17.0454 14.0246 17.2679 13.9333 17.5 13.9333ZM17.3775 7.86667H10.6225C10.319 7.86665 10.025 7.97078 9.79028 8.16134C9.55561 8.35191 9.39485 8.61713 9.33538 8.91187L8.84538 11.3333H19.1538L18.6646 8.91187C18.6052 8.61727 18.4446 8.35217 18.2101 8.16162C17.9756 7.97107 17.6817 7.86685 17.3784 7.86667H17.3775Z"
                fill="#F09136"/>
          </svg>
          </span>
          <div class="camping-name">
          </div>
        </div>
      </div>

      <div class="bottom-thi">
        <div class="camping-jang">
          <p>오시아노 오토 캠핑장</p>
          <s>
            <svg width="66" height="11" viewBox="0 0 66 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                  d="M6.02621 0.351704C5.91712 0.136774 5.68657 0 5.43338 0C5.18019 0 4.95171 0.136774 4.84055 0.351704L3.51698 2.93672L0.561057 3.35095C0.314045 3.38612 0.108201 3.55025 0.0320385 3.77495C-0.0441238 3.99965 0.0176293 4.2478 0.194655 4.41388L2.33955 6.42836L1.83317 9.27521C1.792 9.50967 1.89493 9.74805 2.09871 9.88678C2.3025 10.0255 2.57215 10.0431 2.79446 9.93172L5.43544 8.59329L8.07642 9.93172C8.29873 10.0431 8.56838 10.0275 8.77217 9.88678C8.97596 9.7461 9.07888 9.50967 9.03771 9.27521L8.52927 6.42836L10.6742 4.41388C10.8512 4.2478 10.915 3.99965 10.8368 3.77495C10.7586 3.55025 10.5548 3.38612 10.3078 3.35095L7.34979 2.93672L6.02621 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M19.6087 0.351704C19.4996 0.136774 19.2691 0 19.0159 0C18.7627 0 18.5342 0.136774 18.4231 0.351704L17.0995 2.93672L14.1436 3.35095C13.8966 3.38612 13.6907 3.55025 13.6146 3.77495C13.5384 3.99965 13.6001 4.2478 13.7772 4.41388L15.9221 6.42836L15.4157 9.27521C15.3745 9.50967 15.4774 9.74805 15.6812 9.88678C15.885 10.0255 16.1547 10.0431 16.377 9.93172L19.018 8.59329L21.6589 9.93172C21.8812 10.0431 22.1509 10.0275 22.3547 9.88678C22.5585 9.7461 22.6614 9.50967 22.6202 9.27521L22.1118 6.42836L24.2567 4.41388C24.4337 4.2478 24.4975 3.99965 24.4193 3.77495C24.3411 3.55025 24.1373 3.38612 23.8903 3.35095L20.9323 2.93672L19.6087 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M33.1917 0.351704C33.0826 0.136774 32.8521 0 32.5989 0C32.3457 0 32.1172 0.136774 32.0061 0.351704L30.6825 2.93672L27.7266 3.35095C27.4796 3.38612 27.2737 3.55025 27.1976 3.77495C27.1214 3.99965 27.1832 4.2478 27.3602 4.41388L29.5051 6.42836L28.9987 9.27521C28.9575 9.50967 29.0605 9.74805 29.2642 9.88678C29.468 10.0255 29.7377 10.0431 29.96 9.93172L32.601 8.59329L35.2419 9.93172C35.4643 10.0431 35.7339 10.0275 35.9377 9.88678C36.1415 9.7461 36.2444 9.50967 36.2032 9.27521L35.6948 6.42836L37.8397 4.41388C38.0167 4.2478 38.0805 3.99965 38.0023 3.77495C37.9241 3.55025 37.7203 3.38612 37.4733 3.35095L34.5153 2.93672L33.1917 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M46.7743 0.351704C46.6652 0.136774 46.4346 0 46.1814 0C45.9282 0 45.6998 0.136774 45.5886 0.351704L44.265 2.93672L41.3091 3.35095C41.0621 3.38612 40.8562 3.55025 40.7801 3.77495C40.7039 3.99965 40.7657 4.2478 40.9427 4.41388L43.0876 6.42836L42.5812 9.2752C42.5401 9.50967 42.643 9.74805 42.8468 9.88678C43.0505 10.0255 43.3202 10.0431 43.5425 9.93172L46.1835 8.59329L48.8245 9.93172C49.0468 10.0431 49.3164 10.0275 49.5202 9.88678C49.724 9.7461 49.8269 9.50967 49.7858 9.2752L49.2773 6.42836L51.4222 4.41388C51.5992 4.2478 51.6631 3.99965 51.5848 3.77495C51.5066 3.55025 51.3028 3.38612 51.0558 3.35095L48.0978 2.93672L46.7743 0.351704Z"
                  fill="#D1D1D1"/>
              <path
                  d="M60.3573 0.351704C60.2482 0.136774 60.0176 0 59.7644 0C59.5112 0 59.2828 0.136774 59.1716 0.351704L57.848 2.93672L54.8921 3.35095C54.6451 3.38612 54.4393 3.55025 54.3631 3.77495C54.2869 3.99965 54.3487 4.2478 54.5257 4.41388L56.6706 6.42836L56.1642 9.27521C56.1231 9.50967 56.226 9.74805 56.4298 9.88678C56.6336 10.0255 56.9032 10.0431 57.1255 9.93172L59.7665 8.59329L62.4075 9.93172C62.6298 10.0431 62.8994 10.0275 63.1032 9.88678C63.307 9.7461 63.4099 9.50967 63.3688 9.27521L62.8603 6.42836L65.0052 4.41388C65.1822 4.2478 65.2461 3.99965 65.1678 3.77495C65.0896 3.55025 64.8858 3.38612 64.6388 3.35095L61.6808 2.93672L60.3573 0.351704Z"
                  fill="#D1D1D1"/>
            </svg>
          </s>
          <span>
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="14" cy="14" r="14" fill="white"/>
            <path
                d="M17.3775 7C17.8833 6.9999 18.3735 7.17343 18.7647 7.49104C19.1559 7.80865 19.4239 8.25072 19.523 8.742L19.6954 9.6H20.3438C20.5023 9.60001 20.6556 9.65689 20.7751 9.76013C20.8946 9.86337 20.9723 10.006 20.9939 10.1616L21 10.25C21 10.4071 20.9426 10.5588 20.8383 10.6772C20.7341 10.7956 20.5901 10.8726 20.433 10.8939L20.3438 10.9H19.9579L20.0559 11.3853C20.3283 11.4642 20.5676 11.6285 20.7378 11.8535C20.9081 12.0786 21.0001 12.3522 21 12.6333V16.9667C21 17.3114 20.8617 17.6421 20.6156 17.8859C20.3694 18.1297 20.0356 18.2667 19.6875 18.2667H19.25V19.1333C19.25 19.3632 19.1578 19.5836 18.9937 19.7462C18.8296 19.9087 18.6071 20 18.375 20C18.1429 20 17.9204 19.9087 17.7563 19.7462C17.5922 19.5836 17.5 19.3632 17.5 19.1333V18.2667H10.5V19.1333C10.5 19.3632 10.4078 19.5836 10.2437 19.7462C10.0796 19.9087 9.85706 20 9.625 20C9.39294 20 9.17038 19.9087 9.00628 19.7462C8.84219 19.5836 8.75 19.3632 8.75 19.1333V18.2667H8.3125C7.9644 18.2667 7.63056 18.1297 7.38442 17.8859C7.13828 17.6421 7 17.3114 7 16.9667V12.6333C6.99994 12.3522 7.09193 12.0786 7.26215 11.8535C7.43237 11.6285 7.67166 11.4642 7.94412 11.3853L8.04125 10.9H7.65625C7.4822 10.9 7.31528 10.8315 7.19221 10.7096C7.06914 10.5877 7 10.4224 7 10.25C7 10.0776 7.06914 9.91228 7.19221 9.79038C7.31528 9.66848 7.4822 9.6 7.65625 9.6H8.30375L8.477 8.742C8.57614 8.25072 8.84411 7.80865 9.23529 7.49104C9.62647 7.17343 10.1167 6.9999 10.6225 7H17.3775ZM19.6875 12.2H8.3125C8.19647 12.2 8.08519 12.2457 8.00314 12.3269C7.92109 12.4082 7.875 12.5184 7.875 12.6333V16.9667C7.875 17.0816 7.92109 17.1918 8.00314 17.2731C8.08519 17.3543 8.19647 17.4 8.3125 17.4H19.6875C19.8035 17.4 19.9148 17.3543 19.9969 17.2731C20.0789 17.1918 20.125 17.0816 20.125 16.9667V12.6333C20.125 12.5184 20.0789 12.4082 19.9969 12.3269C19.9148 12.2457 19.8035 12.2 19.6875 12.2ZM10.5 13.9333C10.7321 13.9333 10.9546 14.0246 11.1187 14.1872C11.2828 14.3497 11.375 14.5701 11.375 14.8C11.375 15.0299 11.2828 15.2503 11.1187 15.4128C10.9546 15.5754 10.7321 15.6667 10.5 15.6667C10.2679 15.6667 10.0454 15.5754 9.88128 15.4128C9.71719 15.2503 9.625 15.0299 9.625 14.8C9.625 14.5701 9.71719 14.3497 9.88128 14.1872C10.0454 14.0246 10.2679 13.9333 10.5 13.9333ZM17.5 13.9333C17.7321 13.9333 17.9546 14.0246 18.1187 14.1872C18.2828 14.3497 18.375 14.5701 18.375 14.8C18.375 15.0299 18.2828 15.2503 18.1187 15.4128C17.9546 15.5754 17.7321 15.6667 17.5 15.6667C17.2679 15.6667 17.0454 15.5754 16.8813 15.4128C16.7172 15.2503 16.625 15.0299 16.625 14.8C16.625 14.5701 16.7172 14.3497 16.8813 14.1872C17.0454 14.0246 17.2679 13.9333 17.5 13.9333ZM17.3775 7.86667H10.6225C10.319 7.86665 10.025 7.97078 9.79028 8.16134C9.55561 8.35191 9.39485 8.61713 9.33538 8.91187L8.84538 11.3333H19.1538L18.6646 8.91187C18.6052 8.61727 18.4446 8.35217 18.2101 8.16162C17.9756 7.97107 17.6817 7.86685 17.3784 7.86667H17.3775Z"
                fill="#F09136"/>
          </svg>
          </span>
          <div class="camping-name">
          </div>
        </div>
      </div>

      <div class="bottom-for">

        <div class="camping-jang">
          <p>학암포 오토 캠핑장</p>
          <s>
            <svg width="66" height="11" viewBox="0 0 66 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                  d="M6.02621 0.351704C5.91712 0.136774 5.68657 0 5.43338 0C5.18019 0 4.95171 0.136774 4.84055 0.351704L3.51698 2.93672L0.561057 3.35095C0.314045 3.38612 0.108201 3.55025 0.0320385 3.77495C-0.0441238 3.99965 0.0176293 4.2478 0.194655 4.41388L2.33955 6.42836L1.83317 9.27521C1.792 9.50967 1.89493 9.74805 2.09871 9.88678C2.3025 10.0255 2.57215 10.0431 2.79446 9.93172L5.43544 8.59329L8.07642 9.93172C8.29873 10.0431 8.56838 10.0275 8.77217 9.88678C8.97596 9.7461 9.07888 9.50967 9.03771 9.27521L8.52927 6.42836L10.6742 4.41388C10.8512 4.2478 10.915 3.99965 10.8368 3.77495C10.7586 3.55025 10.5548 3.38612 10.3078 3.35095L7.34979 2.93672L6.02621 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M19.6087 0.351704C19.4996 0.136774 19.2691 0 19.0159 0C18.7627 0 18.5342 0.136774 18.4231 0.351704L17.0995 2.93672L14.1436 3.35095C13.8966 3.38612 13.6907 3.55025 13.6146 3.77495C13.5384 3.99965 13.6001 4.2478 13.7772 4.41388L15.9221 6.42836L15.4157 9.27521C15.3745 9.50967 15.4774 9.74805 15.6812 9.88678C15.885 10.0255 16.1547 10.0431 16.377 9.93172L19.018 8.59329L21.6589 9.93172C21.8812 10.0431 22.1509 10.0275 22.3547 9.88678C22.5585 9.7461 22.6614 9.50967 22.6202 9.27521L22.1118 6.42836L24.2567 4.41388C24.4337 4.2478 24.4975 3.99965 24.4193 3.77495C24.3411 3.55025 24.1373 3.38612 23.8903 3.35095L20.9323 2.93672L19.6087 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M33.1917 0.351704C33.0826 0.136774 32.8521 0 32.5989 0C32.3457 0 32.1172 0.136774 32.0061 0.351704L30.6825 2.93672L27.7266 3.35095C27.4796 3.38612 27.2737 3.55025 27.1976 3.77495C27.1214 3.99965 27.1832 4.2478 27.3602 4.41388L29.5051 6.42836L28.9987 9.27521C28.9575 9.50967 29.0605 9.74805 29.2642 9.88678C29.468 10.0255 29.7377 10.0431 29.96 9.93172L32.601 8.59329L35.2419 9.93172C35.4643 10.0431 35.7339 10.0275 35.9377 9.88678C36.1415 9.7461 36.2444 9.50967 36.2032 9.27521L35.6948 6.42836L37.8397 4.41388C38.0167 4.2478 38.0805 3.99965 38.0023 3.77495C37.9241 3.55025 37.7203 3.38612 37.4733 3.35095L34.5153 2.93672L33.1917 0.351704Z"
                  fill="#EC671A"/>
              <path
                  d="M46.7743 0.351704C46.6652 0.136774 46.4346 0 46.1814 0C45.9282 0 45.6998 0.136774 45.5886 0.351704L44.265 2.93672L41.3091 3.35095C41.0621 3.38612 40.8562 3.55025 40.7801 3.77495C40.7039 3.99965 40.7657 4.2478 40.9427 4.41388L43.0876 6.42836L42.5812 9.2752C42.5401 9.50967 42.643 9.74805 42.8468 9.88678C43.0505 10.0255 43.3202 10.0431 43.5425 9.93172L46.1835 8.59329L48.8245 9.93172C49.0468 10.0431 49.3164 10.0275 49.5202 9.88678C49.724 9.7461 49.8269 9.50967 49.7858 9.2752L49.2773 6.42836L51.4222 4.41388C51.5992 4.2478 51.6631 3.99965 51.5848 3.77495C51.5066 3.55025 51.3028 3.38612 51.0558 3.35095L48.0978 2.93672L46.7743 0.351704Z"
                  fill="#D1D1D1"/>
              <path
                  d="M60.3573 0.351704C60.2482 0.136774 60.0176 0 59.7644 0C59.5112 0 59.2828 0.136774 59.1716 0.351704L57.848 2.93672L54.8921 3.35095C54.6451 3.38612 54.4393 3.55025 54.3631 3.77495C54.2869 3.99965 54.3487 4.2478 54.5257 4.41388L56.6706 6.42836L56.1642 9.27521C56.1231 9.50967 56.226 9.74805 56.4298 9.88678C56.6336 10.0255 56.9032 10.0431 57.1255 9.93172L59.7665 8.59329L62.4075 9.93172C62.6298 10.0431 62.8994 10.0275 63.1032 9.88678C63.307 9.7461 63.4099 9.50967 63.3688 9.27521L62.8603 6.42836L65.0052 4.41388C65.1822 4.2478 65.2461 3.99965 65.1678 3.77495C65.0896 3.55025 64.8858 3.38612 64.6388 3.35095L61.6808 2.93672L60.3573 0.351704Z"
                  fill="#D1D1D1"/>
            </svg>
          </s>
          <span>
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="14" cy="14" r="14" fill="white"/>
            <path
                d="M17.3775 7C17.8833 6.9999 18.3735 7.17343 18.7647 7.49104C19.1559 7.80865 19.4239 8.25072 19.523 8.742L19.6954 9.6H20.3438C20.5023 9.60001 20.6556 9.65689 20.7751 9.76013C20.8946 9.86337 20.9723 10.006 20.9939 10.1616L21 10.25C21 10.4071 20.9426 10.5588 20.8383 10.6772C20.7341 10.7956 20.5901 10.8726 20.433 10.8939L20.3438 10.9H19.9579L20.0559 11.3853C20.3283 11.4642 20.5676 11.6285 20.7378 11.8535C20.9081 12.0786 21.0001 12.3522 21 12.6333V16.9667C21 17.3114 20.8617 17.6421 20.6156 17.8859C20.3694 18.1297 20.0356 18.2667 19.6875 18.2667H19.25V19.1333C19.25 19.3632 19.1578 19.5836 18.9937 19.7462C18.8296 19.9087 18.6071 20 18.375 20C18.1429 20 17.9204 19.9087 17.7563 19.7462C17.5922 19.5836 17.5 19.3632 17.5 19.1333V18.2667H10.5V19.1333C10.5 19.3632 10.4078 19.5836 10.2437 19.7462C10.0796 19.9087 9.85706 20 9.625 20C9.39294 20 9.17038 19.9087 9.00628 19.7462C8.84219 19.5836 8.75 19.3632 8.75 19.1333V18.2667H8.3125C7.9644 18.2667 7.63056 18.1297 7.38442 17.8859C7.13828 17.6421 7 17.3114 7 16.9667V12.6333C6.99994 12.3522 7.09193 12.0786 7.26215 11.8535C7.43237 11.6285 7.67166 11.4642 7.94412 11.3853L8.04125 10.9H7.65625C7.4822 10.9 7.31528 10.8315 7.19221 10.7096C7.06914 10.5877 7 10.4224 7 10.25C7 10.0776 7.06914 9.91228 7.19221 9.79038C7.31528 9.66848 7.4822 9.6 7.65625 9.6H8.30375L8.477 8.742C8.57614 8.25072 8.84411 7.80865 9.23529 7.49104C9.62647 7.17343 10.1167 6.9999 10.6225 7H17.3775ZM19.6875 12.2H8.3125C8.19647 12.2 8.08519 12.2457 8.00314 12.3269C7.92109 12.4082 7.875 12.5184 7.875 12.6333V16.9667C7.875 17.0816 7.92109 17.1918 8.00314 17.2731C8.08519 17.3543 8.19647 17.4 8.3125 17.4H19.6875C19.8035 17.4 19.9148 17.3543 19.9969 17.2731C20.0789 17.1918 20.125 17.0816 20.125 16.9667V12.6333C20.125 12.5184 20.0789 12.4082 19.9969 12.3269C19.9148 12.2457 19.8035 12.2 19.6875 12.2ZM10.5 13.9333C10.7321 13.9333 10.9546 14.0246 11.1187 14.1872C11.2828 14.3497 11.375 14.5701 11.375 14.8C11.375 15.0299 11.2828 15.2503 11.1187 15.4128C10.9546 15.5754 10.7321 15.6667 10.5 15.6667C10.2679 15.6667 10.0454 15.5754 9.88128 15.4128C9.71719 15.2503 9.625 15.0299 9.625 14.8C9.625 14.5701 9.71719 14.3497 9.88128 14.1872C10.0454 14.0246 10.2679 13.9333 10.5 13.9333ZM17.5 13.9333C17.7321 13.9333 17.9546 14.0246 18.1187 14.1872C18.2828 14.3497 18.375 14.5701 18.375 14.8C18.375 15.0299 18.2828 15.2503 18.1187 15.4128C17.9546 15.5754 17.7321 15.6667 17.5 15.6667C17.2679 15.6667 17.0454 15.5754 16.8813 15.4128C16.7172 15.2503 16.625 15.0299 16.625 14.8C16.625 14.5701 16.7172 14.3497 16.8813 14.1872C17.0454 14.0246 17.2679 13.9333 17.5 13.9333ZM17.3775 7.86667H10.6225C10.319 7.86665 10.025 7.97078 9.79028 8.16134C9.55561 8.35191 9.39485 8.61713 9.33538 8.91187L8.84538 11.3333H19.1538L18.6646 8.91187C18.6052 8.61727 18.4446 8.35217 18.2101 8.16162C17.9756 7.97107 17.6817 7.86685 17.3784 7.86667H17.3775Z"
                fill="#F09136"/>
          </svg>
          </span>
          <div class="camping-name">
          </div>
        </div>
      </div>
    </div>

  </div>
</template>
